print("Давай сыграем в крестики-нолики")
a = [['-', '-', '-'], ['-', '-', '-'], ['-', '-', '-']]

for i in a:
    print(i)

def fun1():
    while True:
        i = int(input('Игрок №1 - введи через пробел номер строки: '))
        j = int(input('Игрок №1 - введи через пробел номер столбца: '))
        if i < 3 and j < 3 and a[i][j] == '-':
            a[i][j] = 'X'
            break
        else:
            print('Ошибка. Введенные значения должны быть от 0 до 2 включительно и не совпадать с предыдущими значениями. Попробуй снова')
    for i in a:
        print(i)

def fun2():
    while True:
        i = int(input('Игрок №2 - введи через пробел номер строки: '))
        j = int(input('Игрок №2 - введи через пробел номер столбца: '))
        if i < 3 and j < 3 and a[i][j] == '-':
            a[i][j] = '0'
            break
        else:
            print('Ошибка. Введенные значения должны быть от 0 до 2 включительно и не совпадать с предыдущими значениями. Попробуй снова')
    for i in a:
        print(i)

while True:
    fun1()

    if a[0][0] == a[1][1] == a[2][2] == 'X' or a[2][0] == a[1][1] == a[0][2] == 'X' or a[0][0] == a[0][1] == a[0][2] == 'X' or a[1][0] == a[1][1] == a[1][2] == 'X':
        print('Игрок №1 выиграл')
        break
    elif a[2][0] == a[2][1] == a[2][2] == 'X' or a[0][0] == a[1][0] == a[2][0] == 'X' or a[0][1] == a[1][1] == a[2][1] == 'X' or a[0][2] == a[1][2] == a[2][2] == 'X':
        print('Игрок №1 выиграл')
        break

    if '-' not in str(a):
        print('Ничья')
        break

    fun2()

    if a[0][0] == a[1][1] == a[2][2] == '0' or a[2][0] == a[1][1] == a[0][2] == '0' or a[0][0] == a[0][1] == a[0][2] == '0' or a[1][0] == a[1][1] == a[1][2] == '0':
        print('Игрок №2 выиграл')
        break
    elif a[2][0] == a[2][1] == a[2][2] == '0' or a[0][0] == a[1][0] == a[2][0] == '0' or a[0][1] == a[1][1] == a[2][1] == '0' or a[0][2] == a[1][2] == a[2][2] == '0':
        print('Игрок №2 выиграл')
        break
